# CurtainPanelsParamDefinedTypeDefinedCirculary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CurtainPanelsParamDefinedTypeDefinedCirculary Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Parameter-defined type of curtain panels defined in a circular way and default panel type will be used instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainPanelsParamDefinedTypeDefinedCirculary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainPanelsParamDefinedTypeDefinedCirculary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainPanelsParamDefinedTypeDefinedCirculary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace